ХамелионЦРПТ/src/Documents/ЗаказМарок_ХамелеонЦРПТ/ЗаказМарок_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказМарок_ХамелеонЦРПТ</name>
  <basedOn>Document.GS1_Обувь_ХамелеонЦРПТ</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиКМЭмитированые_ХамелеонЦРПТ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПользователь</name>
    <type>
      <types>CatalogRef.Пользователи_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументов_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>_Order_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводВОборот</name>
    <type>
      <types>DocumentRef.ВводВОборот_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОтправки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговораСОператором</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговораСОператором</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособИзготовленияСИ</name>
    <type>
      <types>EnumRef.СпособИзготовленияСИ_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ШаблоныЭтикеток_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Оригинал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СледующийДокумент</name>
    <type>
      <types>DocumentRef.ЗаказМарок_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННЦЭМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЦЭМ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДогоораСЦЭМ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговораСЦЭМ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоКоличествоКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогКоличествоПолучено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукции</name>
    <type>
      <types>EnumRef.ТипПродукции_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СУЗОбувь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипОплаты_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыпускаТоваров</name>
    <type>
      <types>EnumRef.СпособВыпускаТоваров_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКМ</name>
    <type>
      <types>EnumRef.Шаблоны_подписи_кодов_КМ_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>КМНеПодлежитОплате</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКМ_Табак</name>
    <type>
      <types>EnumRef.Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварПроизведенПриобретенДо1032020</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварВвезенВРФПосле1032020</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВвестиВОборотПослеЭмитирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтчетОбИспользовании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СервисПровайдер</name>
    <type>
      <types>CatalogRef.ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>МВ_Интегратор</name>
    <type>
      <types>CatalogRef.МВ_Интеграторы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяПродукция</name>
    <type>
      <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Обрабатывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>CatalogRef.ID_строки_партия_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>CatalogRef.КодТНВЭД_ХамелеонЦРПТ</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыпускаТоваров</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособФормированияСН</name>
      <type>
        <types>EnumRef.СпособФормированияСН_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСИ</name>
      <type>
        <types>EnumRef.ВидСИ_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидМаркировки</name>
      <type>
        <types>EnumRef.ВидМаркировки_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСтроки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПолучено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоследнийБлок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОшибкаПолучения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ГоденДо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДСУЗ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитДляСопотавления</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВСД</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипКодаМаркировки</name>
      <type>
        <types>EnumRef.ТипКодаМаркировки_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоЧаса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводства</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКороба</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПаллет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>cis</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КМИзAPI</name>
    <attributes>
      <name>Order_Id_Line</name>
      <type>
        <types>CatalogRef.ID_строки_партия_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКМ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКМ_Короткий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОшибкиПолучения</name>
    <attributes>
      <name>Ошибка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодОшибки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ХамелионЦРПТ/src/AccumulationRegisters/ОстаткиКМЭмитированые_ХамелеонЦРПТ/ОстаткиКМЭмитированые_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиКМЭмитированые_ХамелеонЦРПТ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ID_Строки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КМОплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ХамелионЦРПТ/src/AccumulationRegisters/ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ/ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ID_Строки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КМОплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ХамелионЦРПТ/src/InformationRegisters/НомераКМ_ХамелеонЦРПТ/НомераКМ_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомераКМ_ХамелеонЦРПТ</name>
  <resources>
    <name>OrderID</name>
    <type>
      <types>CatalogRef.ID_строки_партия_ХамелеонЦРПТ</types>
    </type>
  </resources>
  <resources>
    <name>НомерКМ_Короткий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КМНапечатан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>НомерКМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументЗаказа</name>
    <type>
      <types>DocumentRef.ЗаказМарок_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСтроки_1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/InformationRegisters/ТипКМ_ХамелеонЦРПТ/ТипКМ_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТипКМ_ХамелеонЦРПТ</name>
  <resources>
    <name>Тип</name>
    <type>
      <types>EnumRef.Тип_КМ_ХамелеонЦРПТ</types>
    </type>
  </resources>
  <dimensions>
    <name>cis</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/Enums/Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ/Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ</name>
  <enumValues>
    <name>Блок</name>
  </enumValues>
  <enumValues>
    <name>Пачка</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Documents/ЗаказМарок_ХамелеонЦРПТ/ObjectModule.bsl
Функция дополнитьСтроку(Ср)
	ВОзврат Обработки._Запуск_ХамелеонЦРПТ.ДополнитьСтроку_11(xmlString(Ср),14,"0");
	
Конецфункции

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОБъект._Order_ID="";
	ЭтоТОбъект.Статус="";
ЭтотОБъект.СУЗОбувь=Ложь;
ЭтотОБъект.ВводВОборот=Неопределено;
	ЭтотОбъект.ОшибкаОтправки="";
	ЭтотОбъект.СерийныеНомера.Очистить();
	ЭтоТОбъект.КМИзAPI.Очистить();
	АвтоСерийные=ТекущийПользователь.ФормироватьСерийныеНомераАвтоматически;
	Если АвтоСерийные Тогда
		Для каждого ТекД Из Товары Цикл
			ТекД.ИДСУЗ=Неопределено;
			ТекД.СтатусСтроки=Неопределено;
			ТЕкД.КоличествоПолучено=0;
			ТекД.НомерСтрокиСвязи=ТекД.НомерСтроки-1;
			ТекД.СтатусСтроки="";
			ТекД.ОшибкаПолучения="";
			Для Сч=1 По ТекД.КоличествоКМ цикл
				Добав=СерийныеНомера.Добавить();
				Добав.НомерСтрокиСвязи=ТекД.НомерСтрокиСвязи;
				
				Добав.GTIN=ДополнитьСтроку(ТекД.GTIN.GTIN);
				Добав.НаименованиеТовара=ТекД.GTIN;
				Если АвтоСерийные Тогда
					Если Не Значениезаполнено(Добав.СерийныйНомер) Тогда
						
						СерийныйНомер=xmlString(Новый УникальныйИдентификатор());
						СерийныйНомер=СтрЗаменить(СерийныйНомер,"-","");
						Добав.СерийныйНомер=Сред(СерийныйНомер,1,13);
						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;                                   
			                текд.ID=""
		КонецЦикла;
		СерийныеНомера.Сортировать("НомерСтрокиСвязи");
	Иначе
		ДЛя Каждого Стр из товары Цикл
			Стр.ИДСУЗ=Неопределено;
			
			Стр.СтатусСтроки=Неопределено;
			Стр.ОшибкаПолучения="";
			Стр.КоличествоПолучено=0;   стр.ID="";
		КонецЦикла
	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое обработчика.
	
	
	
	Движения.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Записывать=Истина;
	Движения.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Очистить();
	
	
	Движения.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ.Записывать=Истина;
	Движения.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ.Очистить();
	
	Если (ЭтотОбъект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Табак
		ИЛИ ЭтотОбъект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.АльтернативныйТабак)
		И ЭтотОбъект.ШаблонКМ_Табак=Перечисления.Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ.Блок Тогда
	//	Возврат;
	КонецЕсли;
	
	Продукция_Табл=Новый ТаблицаЗначений;
	Продукция_Табл.Колонки.Добавить("GTIN");
	Продукция_Табл.Колонки.Добавить("Продукция");
	Продукция_Табл.Индексы.Добавить("GTIN");
	
	
	Если //ЭтотОбъект.Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.КМЭмитирован 
		// ЭтотОбъект.Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.КМЧастичноЭмитированы 
		 ЭтотОбъект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Обувь
		ИЛИ ЭтотОбъект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Шины
		ИЛИ ЭтотОбъект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Свет
		ИЛИ ЭтотОбъект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Одежда
	//	ИЛИ ЭтотОбъект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Табак
	//	ИЛИ ЭтотОбъект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.АльтернативныйТабак
		
		//ИЛИ ЭтотОбъект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Фармацевтика
		ИЛИ ЭтотОбъект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Парфюм
		ИЛИ ЭтотОбъект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Фото
		ИЛИ ЭтотОбъект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.КреслаКоляски
		ИЛИ ЭтотОбъект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Пиво
		ИЛИ (ЭтотОбъект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Молоко
		     И ЭтотОБъект.ИспользоватьОтчетОбИспользовании=Ложь)
		Тогда
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НомераКМ_ХамелеонЦРПТ.НомерКМ
			|ИЗ
			|	РегистрСведений.НомераКМ_ХамелеонЦРПТ КАК НомераКМ_ХамелеонЦРПТ
			|ГДЕ
			|	НомераКМ_ХамелеонЦРПТ.ДокументЗаказа = &ДокументЗаказа";
		
		Запрос.УстановитьПараметр("ДокументЗаказа", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда 
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Стр=ВыборкаДетальныеЗаписи;
				
				
				cis=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьКороткийНомерКМ(Стр.НомерКМ,ТипПродукции);
				
				
				Добав=Движения.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Добавить();
				Добав.ID_Строки="";
				Добав.ВидДвижения=ВидДвиженияНакопления.Приход;
				Добав.Количество=1;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				
					ГТИН_1=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьGTINСМарки(cis);
					Если (ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Табак
						ИЛИ ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.АльтернативныйТабак
						)
						И 
					ШаблонКМ_Табак=Перечисления.Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ.Блок Тогда
					Попытка
						Нстр=Продукция_Табл.Найти(Число(ГТИН_1),"GTIN");
						Если НСтр=Неопределено тогда
							Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(ГТИН_1));
							Добав_Пр=Продукция_Табл.Добавить();
							Добав_Пр.Продукция=Добав.Продукция;
							Добав_Пр.GTIN=Число(ГТИН_1);
						Иначе
							Добав.Продукция=						НСтр.Продукция;
						Конецесли;
					Исключение
						Добав.Продукция=Неопределено;
					КонецПопытки;
					
					Если не ЗначениеЗаполнено(Добав.Продукция) Тогда
						Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("GTINУпаковки",ГТИН_1);
					КонецЕсли;
					Если не ЗначениеЗаполнено(Добав.Продукция) Тогда
						Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(ГТИН_1));
					Конецесли;
					
				Иначе
					
					Нстр=Продукция_Табл.Найти(Число(ГТИН_1),"GTIN");
					Если НСтр=Неопределено тогда
						Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(ГТИН_1));
						Добав_Пр=Продукция_Табл.Добавить();
						Добав_Пр.Продукция=Добав.Продукция;
						Добав_Пр.GTIN=Число(ГТИН_1);
						
					Иначе
Добав.Продукция=						НСтр.Продукция;
					Конецесли;
				КонецЕсли;	
				Если Не ЗначениеЗаполнено(Добав.Продукция) Тогда
					СпрП=Справочники.Продукция_ХамелеонЦРПТ.СоздатьЭлемент();
					СпрП.GTIN=Число(ГТИН_1);
					СпрП.Наименование=СпрП.GTIN;
					СпрП.НаименованиеТовара=СпрП.GTIN;
					СпрП.Тип=Перечисления.ТипПродукции_ХамелеонЦРПТ.Обувь;
					СпрП.Записать();
					Добав.Продукция=СпрП.Ссылка
				КонецЕсли;
					
				Добав.СерийныйНомер=cis;
				
				
				
				
			Конеццикла;
		
		ИначеЕсли КМИзAPI.Количество()>0 Тогда
			Для Каждого Стр Из ЭтотОбъект.КМИзAPI Цикл
				
				cis=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьКороткийНомерКМ(Стр.НомерКМ,ТипПродукции);
				
				Добав=Движения.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Добавить();
				Добав.ID_Строки="";
				Добав.ВидДвижения=ВидДвиженияНакопления.Приход;
				Добав.Количество=1;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				ГТИН_1=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьGTINСМарки(cis);
				
				Если (ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Табак
					  ИЛИ ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.АльтернативныйТабак)
					И 
					ШаблонКМ_Табак=Перечисления.Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ.Блок Тогда
					Попытка
						Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("GTINУпаковки",xmlString(число(ГТИН_1)));
					Исключение
						Добав.Продукция=Неопределено
					КонецПопытки;
					Если не ЗначениеЗаполнено(Добав.Продукция) Тогда
						Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("GTINУпаковки",ГТИН_1);
						
					КонецЕсли;
						
					Если не ЗначениеЗаполнено(Добав.Продукция) Тогда
						Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(ГТИН_1));
					Конецесли;
				
					
					
				Иначе
					Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(ГТИН_1));
				КонецЕсли;	
				//Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(ГТИН_1));
				Если Не ЗначениеЗаполнено(Добав.Продукция) Тогда
					СпрП=Справочники.Продукция_ХамелеонЦРПТ.СоздатьЭлемент();
					СпрП.GTIN=Число(ГТИН_1);
					СпрП.Наименование=СпрП.GTIN;
					СпрП.НаименованиеТовара=СпрП.GTIN;
					СпрП.Тип=Перечисления.ТипПродукции_ХамелеонЦРПТ.Обувь;
					
					СпрП.Записать();
					Добав.Продукция=СпрП.Ссылка
				КонецЕсли;
					
				Добав.СерийныйНомер=cis;
				
				
			КонецЦикла;
		Иначе
		
			Для Каждого Стр Из ЭтотОбъект.СерийныеНомера Цикл
				Тов=ЭтотОБъект.Товары.Найти(Стр.НомерСтрокиСвязи,"НомерСтрокиСвязи");
				
				//Если Не ЗначениеЗаполнено(Стр.cis) Тогда
				//Если ТипЗнч(Тов.КодТНВЭД)
					Стр.cis="01"+Стр.GTIN+"21"+Стр.СерийныйНомер;
					//"240"+xmlString(сред(Тов.КодТНВЭД.Код,1,4));
				//КонецЕсли;
				
				Добав=Движения.ОстаткиКМЭмитированые_ХамелеонЦРПТ.Добавить();
				Добав.ID_Строки=Тов.ID;
				Добав.ВидДвижения=ВидДвиженияНакопления.Приход;
				Добав.Количество=1;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				Добав.Продукция=Тов.GTIN;
				Добав.СерийныйНомер=Стр.cis;
				
				
			КонецЦикла;
		Конецесли;
	ИначеЕсли  (ЭтотОбъект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Молоко 
		И ЭтотОБъект.ИспользоватьОтчетОбИспользовании=Истина)
		ИЛИ ЭтотОбъект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.ПитьеваяВода
		ИЛИ ЭтотОБъект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.АльтернативныйТабак
		ИЛИ ЭтотОБъект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Табак
		ИЛИ ЭтотОбъект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Фармацевтика
		
		Тогда
		
		
		
		
		
		
		
		
		
		
		
	Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НомераКМ_ХамелеонЦРПТ.НомерКМ,
			|	НомераКМ_ХамелеонЦРПТ.НомерКМ_Короткий
			|ИЗ
			|	РегистрСведений.НомераКМ_ХамелеонЦРПТ КАК НомераКМ_ХамелеонЦРПТ
			|ГДЕ
			|	НомераКМ_ХамелеонЦРПТ.ДокументЗаказа = &ДокументЗаказа";
		
		Запрос.УстановитьПараметр("ДокументЗаказа", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда 
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				            cis=ВыборкаДетальныеЗаписи.НомерКМ_Короткий;
							
				Добав=Движения.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ.Добавить();
				Добав.ID_Строки="";
				Добав.ВидДвижения=ВидДвиженияНакопления.Приход;
				Добав.Количество=1;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				
					ГТИН_1=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьGTINСМарки(cis);
					Если (ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Табак 
						ИЛИ ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.АльтернативныйТабак)
						И 
					ШаблонКМ_Табак=Перечисления.Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ.Блок Тогда
					
					
					Попытка
						Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("GTINУпаковки",xmlString(число(ГТИН_1)));
					Исключение
						Добав.Продукция=Неопределено
					КонецПопытки;
					Если не ЗначениеЗаполнено(Добав.Продукция) Тогда
						Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("GTINУпаковки",ГТИН_1);
						
					КонецЕсли;
					
	
					Если не ЗначениеЗаполнено(Добав.Продукция) Тогда
						Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(ГТИН_1));
					Конецесли;
									
					
				Иначе
					Попытка
						Нстр=Продукция_Табл.Найти(Число(ГТИН_1),"GTIN");
						Если НСтр=Неопределено тогда
							Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(ГТИН_1));
							Добав_Пр=Продукция_Табл.Добавить();
							Добав_Пр.Продукция=Добав.Продукция;
							Добав_Пр.GTIN=Число(ГТИН_1);
						Иначе
							Добав.Продукция=						НСтр.Продукция;
						Конецесли;
					Исключение
						Добав.Продукция=Неопределено;
					КонецПопытки;
					//Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(ГТИН_1));
				КонецЕсли;	
				Если Не ЗначениеЗаполнено(Добав.Продукция) Тогда
					СпрП=Справочники.Продукция_ХамелеонЦРПТ.СоздатьЭлемент();
					СпрП.GTIN=Число(ГТИН_1);
					СпрП.Наименование=СпрП.GTIN;
					СпрП.НаименованиеТовара=СпрП.GTIN;
					СпрП.Тип=Перечисления.ТипПродукции_ХамелеонЦРПТ.Обувь;
					СпрП.Записать();
					Добав.Продукция=СпрП.Ссылка
				КонецЕсли;
					
				Добав.СерийныйНомер=cis;
				
				
			Конеццикла;
		
		ИначеЕсли КМИзAPI.Количество()>0 Тогда
			Для Каждого Стр Из ЭтотОбъект.КМИзAPI Цикл
				
				            cis=Стр.НомерКМ_Короткий;
			
				
				
				Добав=Движения.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ.Добавить();
				Добав.ID_Строки="";
				Добав.ВидДвижения=ВидДвиженияНакопления.Приход;
				Добав.Количество=1;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				ГТИН_1=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьGTINСМарки(cis);
				
				Если (ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Табак
					ИЛИ ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.АльтернативныйТабак)
					
					И
					
					ШаблонКМ_Табак=Перечисления.Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ.Блок Тогда
					Попытка
						Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("GTINУпаковки",xmlString(число(ГТИН_1)));
					Исключение
						Добав.Продукция=Неопределено
					КонецПопытки;
					Если не ЗначениеЗаполнено(Добав.Продукция) Тогда
						Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("GTINУпаковки",ГТИН_1);
						
					КонецЕсли;
					
	
					Если не ЗначениеЗаполнено(Добав.Продукция) Тогда
						Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(ГТИН_1));
					Конецесли;
									
				Иначе
					Попытка
						Нстр=Продукция_Табл.Найти(Число(ГТИН_1),"GTIN");
						Если НСтр=Неопределено тогда
							Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(ГТИН_1));
							Добав_Пр=Продукция_Табл.Добавить();
							Добав_Пр.Продукция=Добав.Продукция;
							Добав_Пр.GTIN=Число(ГТИН_1);
						Иначе
							Добав.Продукция=						НСтр.Продукция;
						Конецесли;
					Исключение
						Добав.Продукция=Неопределено;
					КонецПопытки;
					
					//Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(ГТИН_1));
				КонецЕсли;	
				//Добав.Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("gtin",Число(ГТИН_1));
				Если Не ЗначениеЗаполнено(Добав.Продукция) Тогда
					СпрП=Справочники.Продукция_ХамелеонЦРПТ.СоздатьЭлемент();
					СпрП.GTIN=Число(ГТИН_1);
					СпрП.Наименование=СпрП.GTIN;
					СпрП.НаименованиеТовара=СпрП.GTIN;
					СпрП.Тип=Перечисления.ТипПродукции_ХамелеонЦРПТ.Обувь;
					
					СпрП.Записать();
					Добав.Продукция=СпрП.Ссылка
				КонецЕсли;
					
				Добав.СерийныйНомер=cis;
				
				
			КонецЦикла;
		Иначе
		
			Для Каждого Стр Из ЭтотОбъект.СерийныеНомера Цикл
				Тов=ЭтотОБъект.Товары.Найти(Стр.НомерСтрокиСвязи,"НомерСтрокиСвязи");
				
				//Если Не ЗначениеЗаполнено(Стр.cis) Тогда
					Стр.cis="01"+Стр.GTIN+"21"+Стр.СерийныйНомер;
					//+"240"+xmlString(сред(Тов.КодТНВЭД.Код,1,4));
				//КонецЕсли;
				
				Добав=Движения.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ.Добавить();
				Добав.ID_Строки=Тов.ID;
				Добав.ВидДвижения=ВидДвиженияНакопления.Приход;
				Добав.Количество=1;
				Добав.Организация=ЭтотОбъект.Организация;
				Добав.Период=Дата;
				Добав.Продукция=Тов.GTIN;
				Добав.СерийныйНомер=Стр.cis;
				
				
			КонецЦикла;
		Конецесли;
		
		
		
		
		
	
	КонецЕсли;
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
	
	Если Товары.Количество()>0 Тогда
		
		ПерваяПродукция=Товары[0].GTIN
		
	Конецесли;
	
	ПолучиилНомерКМ=Ложь;
	ОшибкаЕсть=ложь;
	Ожидаем=Ложь;
	Для каждого Стр Из Товары Цикл
		Если Стр.КоличествоПолучено>0 
			ИЛИ Стр.СтатусСтроки="Получено" Тогда
			ПолучиилНомерКМ=Истина;
			
		КонецЕслИ;
		Если Стр.СтатусСтроки="Ошибка"
			Или Стр.СтатусСтроки="REJECTED"
			Тогда
			ОшибкаЕсть=Истина;
		КонецЕслИ;
		
		Если Стр.СтатусСтроки="Обработка в ЦРПТ"
			ИЛИ Стр.СтатусСтроки="PENDING"
			Тогда
			Ожидаем=Истина;
			
		КонецЕслИ;
		
		
	Конеццикла;
	
	//Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.Отправлен;
	Если Ожидаем Тогда
		Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.ВПроцессе;
	ИначеЕсли ПолучиилНомерКМ И Товары.Итог("КоличествоКМ")=Товары.Итог("КоличествоПолучено") Тогда
		Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.КМЭмитирован;
	ИначеЕсли ПолучиилНомерКМ И Товары.Итог("КоличествоКМ")<>Товары.Итог("КоличествоПолучено") Тогда
		Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.КМЧастичноЭмитированы;
	ИначеЕсли ОшибкаЕсть Тогда
		Если ПолучиилНомерКМ Тогда
			ПометкаУдаления=Ложь;
			Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.КМЧастичноЭмитированы;
				РежимЗаписи=РежимЗаписиДокумента.Проведение;
		Иначе
			Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.Отказ;
			ПометкаУдаления=Истина;
			Если Проведен Тогда
				РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения;
			Иначе
				РежимЗаписи=РежимЗаписиДокумента.Запись;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕслИ;
	
	
	ТаблицаДляЗаписиВТипКМ_ХамелеонЦРПТ=Новый ТаблицаЗначений;
	ТаблицаДляЗаписиВТипКМ_ХамелеонЦРПТ.Колонки.Добавить("cis");
	ТаблицаДляЗаписиВТипКМ_ХамелеонЦРПТ.Колонки.Добавить("Тип");
	ТаблицаДляЗаписиВТипКМ_ХамелеонЦРПТ.Индексы.Добавить("cis");
	
	ЭтотОбъект.ИтогоКоличествоКМ=Товары.Итог("КоличествоКМ");
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НомераКМ_ХамелеонЦРПТ.НомерКМ
			|ИЗ
			|	РегистрСведений.НомераКМ_ХамелеонЦРПТ КАК НомераКМ_ХамелеонЦРПТ
			|ГДЕ
			|	НомераКМ_ХамелеонЦРПТ.ДокументЗаказа = &ДокументЗаказа";
		
		Запрос.УстановитьПараметр("ДокументЗаказа", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда 
			Если КМизAPI.Количество()>0 Тогда
				Для Каждого Стр_1 Из КМизAPI Цикл
					
					РегСв=РегистрыСведений.НомераКМ_ХамелеонЦРПТ.СоздатьНаборЗаписей();
					РегСв.Отбор.НомерКМ.Установить(Стр_1.НомерКМ);
					РегСв.Отбор.ДокументЗаказа.Установить(Ссылка);
					Добав=РегСв.Добавить();
					Добав.НомерКМ=Стр_1.НомерКМ;
					
					
					cis=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьКороткийНомерКМ(Стр_1.НомерКМ,ТипПродукции);

					Добав.НомерКМ_Короткий=cis;
					
					
		Если ТаблицаДляЗаписиВТипКМ_ХамелеонЦРПТ.Найти(cis,"cis")=Неопределено тогда
					
			РегДв=РегистрыСведений.ТипКМ_ХамелеонЦРПТ.СоздатьНаборЗаписей();
			РегДв.Отбор.cis.Установить(cis);
			РегДв.Записать(Истина);
					
					
				Добав_1=ТаблицаДляЗаписиВТипКМ_ХамелеонЦРПТ.Добавить();
				Добав_1.cis=cis;
				Если ШаблонКМ_Табак=Перечисления.Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ.Блок 
					И (ТекущийПользователь.СайтыВходаВСистему.Наименование="Табак" ИЛИ
					ТекущийПользователь.СайтыВходаВСистему.Наименование="Альтернативный табак"
					)
					Тогда
					Добав_1.Тип=Перечисления.Тип_КМ_ХамелеонЦРПТ.Упаковка
				Иначе
					Добав_1.Тип=Перечисления.Тип_КМ_ХамелеонЦРПТ.Штука;
				КонецЕсли;
				
				
				//Добав_1.Тип=Перечисления.Тип_КМ_ХамелеонЦРПТ.Штука;
				
		КонецЕсли;
					
					
					Добав.ДокументЗаказа=Ссылка;
					РегСв.Записать(Истина);
					
					
				Конеццикла;
				 КМИзAPI.Очистить();
			Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НомераКМ_ХамелеонЦРПТ.НомерКМ
			|ИЗ
			|	РегистрСведений.НомераКМ_ХамелеонЦРПТ КАК НомераКМ_ХамелеонЦРПТ
			|ГДЕ
			|	НомераКМ_ХамелеонЦРПТ.ДокументЗаказа = &ДокументЗаказа";
		
		Запрос.УстановитьПараметр("ДокументЗаказа", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
			
				ИтогКоличествоПолучено=ВыборкаДетальныеЗаписи.Количество();
				
				
			Иначе
				ИтогКоличествоПолучено=ВыборкаДетальныеЗаписи.Количество();
			КонецЕсли;
		Иначе
			ИтогКоличествоПолучено=КМизAPI.Количество();
		КонецЕсли;
		
		Если не ЗначениеЗаполнено(Статус) Тогда
			Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.ПодготовленКОтправке;
		КонецЕсли;
		
		Если Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.КМЧастичноЭмитированы
			ИЛИ Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.КМЭмитирован Тогда
			Для Каждого Стр_1 Из Товары Цикл
					КолП=Стр_1.КоличествоПолучено;
				Стр_1.КоличествоПолучено=0;
				
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	НомераКМ_ХамелеонЦРПТ.НомерКМ
					|ИЗ
					|	РегистрСведений.НомераКМ_ХамелеонЦРПТ КАК НомераКМ_ХамелеонЦРПТ
					|ГДЕ
					|	НомераКМ_ХамелеонЦРПТ.ДокументЗаказа = &ДокументЗаказа";
				
				Запрос.УстановитьПараметр("ДокументЗаказа", Ссылка);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
				Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда 
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						Стр=ВыборкаДетальныеЗаписи;
						
						cis=Сред(СтрЗаменить(Стр.НомерКМ,"%1D",""),1,38);
						
						
							Если Сред(cis,32,3)<>"240" Тогда
								cis=Сред(Стр.НомерКМ,1,Найти(Стр.НомерКМ,"%1D")-1);
								cis=РаскодироватьСтроку(cis,СпособКодированияСтроки.КодировкаURL);
							КонецЕсли;
						Если Число(Стр_1.GTIN.GTIN)=Число(ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьGTINСМарки(cis)) Тогда
							Стр_1.КоличествоПолучено=Стр_1.КоличествоПолучено+1;
						КонецЕсли;
						
					КонецЦикла;
				
				Иначе
				
					Для Каждого Стр_2 Из КМИзAPI Цикл
						Если Число(Стр_1.GTIN.GTIN)=Число(ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьGTINСМарки(Стр_2.НомерКМ)) Тогда
							Стр_1.КоличествоПолучено=Стр_1.КоличествоПолучено+1;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				Если Стр_1.КоличествоПолучено=0 Тогда
					Стр_1.КоличествоПолучено=КолП
				КонецЕсли;
			Конеццикла;
			
		КонецЕсли;
		
		Для Каждого Стр_1 Из КМИзAPI Цикл
			
			
			
			Если ИСТИНА ИЛИ Не ЗначениеЗаполнено(Стр_1.НомерКМ_Короткий) Тогда
				
				cis=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ПолучитьКороткийНомерКМ(Стр_1.НомерКМ,ТипПродукции);
				Стр_1.НомерКМ_Короткий=cis;				
				
				
			КонецЕсли;
			
			
	Если ТаблицаДляЗаписиВТипКМ_ХамелеонЦРПТ.Найти(Стр_1.НомерКМ_Короткий,"cis")=Неопределено тогда
					
			РегДв=РегистрыСведений.ТипКМ_ХамелеонЦРПТ.СоздатьНаборЗаписей();
			РегДв.Отбор.cis.Установить(Стр_1.НомерКМ_Короткий);
			РегДв.Записать(Истина);
					
					
				Добав_1=ТаблицаДляЗаписиВТипКМ_ХамелеонЦРПТ.Добавить();
				Добав_1.cis=Стр_1.НомерКМ_Короткий;
				
				Если ШаблонКМ_Табак=Перечисления.Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ.Блок 
					И (ТекущийПользователь.СайтыВходаВСистему.Наименование="Табак" ИЛИ
					ТекущийПользователь.СайтыВходаВСистему.Наименование="Альтернативный табак"
					)
					Тогда
					Добав_1.Тип=Перечисления.Тип_КМ_ХамелеонЦРПТ.Упаковка
				Иначе
					Добав_1.Тип=Перечисления.Тип_КМ_ХамелеонЦРПТ.Штука;
				КонецЕсли;
				
		КонецЕсли;
					
					
			
			
		КонецциклА;
		
		Если Товары.Итог("КоличествоКМ")<>0 Тогда
			Если ИтогКоличествоПолучено=товары.Итог("КоличествоКМ") тогда
				Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.КМЭмитирован
			ИначеЕсли ИтогКоличествоПолучено>0 Тогда
				Статус=Перечисления.СтатусыДокументов_ХамелеонЦРПТ.КМЧастичноЭмитированы
			КонецЕсли;
		КонецЕсли;
		
		
		Если Не ЗначениеЗаполнено(ТипПродукции) тогда
			Объект=ЭтотОбъект;
			Если Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Шины" Тогда
				Объект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Шины;
			ИначеЕсли Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Молоко" Тогда
				Объект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Молоко;
			ИначеЕсли Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Одежда" Тогда
				Объект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Одежда;
			ИначеЕсли Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Табак" Тогда
				Объект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Табак;
			ИначеЕсли Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Альтернативный табак" Тогда
				Объект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.АльтернативныйТабак;
			ИначеЕсли Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Фармацевтика" Тогда
				Объект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Фармацевтика;
			ИначеЕсли Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Фото" Тогда
				Объект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Фото;
			ИначеЕсли Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Парфюм" Тогда
				Объект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Парфюм;
			ИначеЕсли Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Велосипеды" Тогда
				Объект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Велосипеды;
				
			ИначеЕсли Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Питьевая вода" Тогда
				Объект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.ПитьеваяВода;
				
			ИначеЕсли Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Кресла-коляски" Тогда
				Объект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.КреслаКоляски;
			ИначеЕсли Объект.ТекущийПользователь.СайтыВходаВСистему.Наименование="Пиво" Тогда
				Объект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Пиво;
				
			Иначе
				Объект.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Обувь
			КонецЕсли;
			
		КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ДатаПроизводства=ТекущаяДата();
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено Тогда
		
		Если ТипДанныхЗаполнения <> Тип("Структура")
			И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
			ДокументОснование = ДанныеЗаполнения;
		ИначеЕсли ТипДанныхЗаполнения = Тип("Структура")
			И ДанныеЗаполнения.Свойство("Основание")
			И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Основание.Метаданные()) Тогда
			ДокументОснование = ДанныеЗаполнения.Основание;
		КонецЕсли;

		Если ДокументОснование <> Неопределено Тогда
			ДокОснование=Документоснование;
			ЗаполнитьЗначенияСвойств(ЭтотОБъект,ДокОснование,,"Номер,Дата,Статус");
			
	
			
			
			Если ДокОснование.МолокоGS.Количество()>0 Тогда
					Для Каждого Стр_1 Из ДокОснование.МолокоGS Цикл
						Если ЗначениеЗаполнено(Стр_1.GTIN) Тогда
			ШтрихКод=СокрЛП(xmlstring(Стр_1.GTIN));
				
				              			Продукция=Неопределено;
				Попытка
					Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("GTIN",число(ШтрихКод));
				исключение
				КонецПопытки;
				Если Не ЗначениеЗАполнено(Продукция) Тогда
					Попытка
						Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("КодВУчетнойСистеме",Число(ШтрихКод));
					Исключение
					КонецПопытки;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Продукция) Тогда
					Сообщить("Не правильный отсканированный штрихкод "+ШтрихКод);
					Продолжить;
				КонецЕсли;
				НСтр=Товары.НайтиСтроки(Новый Структура("GTIN",Продукция));
				Если НСтр.Количество()=0 Тогда
					НСтр=Товары.Добавить();
				НСтр.GTIN=Продукция;
				    НСтр.КодТНВЭД=Продукция.КодТНВЭД;
						Если Продукция.СтранаПроизводства.Альфа2="RU" Тогда
				НСтр.СпособВыпускаТоваров="Производство в РФ";
			Иначе
						НСтр.СпособВыпускаТоваров="Ввезен в РФ";
				
			КонецЕсли;

ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.UNIT;
Если Найти(Врег(Продукция.ТипУпаковки.Наименование),"BUNDLE")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.BUNDLE;
	
ИначеЕсли Найти(Врег(Продукция.ТипУпаковки.Наименование),"SET")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.SET;
	
	
Конецесли;
НСтр.ТипКодаМаркировки=ТипКодаМаркировки;
			
				ПолучитьПараметрыПоПльзователию=ПолучитьПараметрыПоПользователю(ТекущийПользователь);
					ЗаполнитьЗначенияСвойств(НСтр, ПолучитьПараметрыПоПльзователию);
				Иначе
					НСтр=Нстр[0];
				КонецЕсли;
					НСтр.НомерСтрокиСвязи=НСтр.НомерСтроки;
					Если ЗначениеЗаполнено(Стр_1.КоличествоКМ) Тогда
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+Стр_1.КоличествоКМ;
					Иначе
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+1;
					КонецЕсли;
				
			
				Иначе
					Сообщить("При копировании наименование "+ Стр_1.НаименованиеТовараНаЭтикетке + " продукции пропущено.");
					
						КонецЕсли;
						
					КонецЦикла;
				

		ИначеЕсли ДокОснование.АльтернативныйТабакGS.Количество()>0 Тогда
					Для Каждого Стр_1 Из ДокОснование.АльтернативныйТабакGS Цикл
						Если ЗначениеЗаполнено(Стр_1.GTIN) Тогда
							ШтрихКод=СокрЛП(xmlstring(Стр_1.GTIN));
				             Продукция=Неопределено;
				Попытка
					Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("GTIN",число(ШтрихКод));
				исключение
				КонецПопытки;
				Если Не ЗначениеЗАполнено(Продукция) Тогда
					Попытка
						Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("КодВУчетнойСистеме",Число(ШтрихКод));
					Исключение
					КонецПопытки;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Продукция) Тогда
					Сообщить("Не правильный отсканированный штрихкод "+ШтрихКод);
					Продолжить;
				КонецЕсли;
				НСтр=Товары.НайтиСтроки(Новый Структура("GTIN",Продукция));
				Если НСтр.Количество()=0 Тогда
					НСтр=Товары.Добавить();
				НСтр.GTIN=Продукция;
				
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.UNIT;
Если Найти(Врег(Продукция.ТипУпаковки.Наименование),"BUNDLE")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.BUNDLE;
	
ИначеЕсли Найти(Врег(Продукция.ТипУпаковки.Наименование),"SET")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.SET;
	
	
Конецесли;
НСтр.ТипКодаМаркировки=ТипКодаМаркировки;
				
				    НСтр.КодТНВЭД=Продукция.КодТНВЭД;
						Если Продукция.СтранаПроизводства.Альфа2="RU" Тогда
				НСтр.СпособВыпускаТоваров="Производство в РФ";
			Иначе
						НСтр.СпособВыпускаТоваров="Ввезен в РФ";
				
			КонецЕсли;

			
			
				ПолучитьПараметрыПоПльзователию=ПолучитьПараметрыПоПользователю(ТекущийПользователь);
					ЗаполнитьЗначенияСвойств(НСтр, ПолучитьПараметрыПоПльзователию);
				Иначе
					НСтр=Нстр[0];
				КонецЕсли;
					НСтр.НомерСтрокиСвязи=НСтр.НомерСтроки;
					Если ЗначениеЗаполнено(Стр_1.КоличествоКМ) Тогда
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+Стр_1.КоличествоКМ;
					Иначе
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+1;
					КонецЕсли;
				
			
				Иначе
					Сообщить("При копировании наименование "+ Стр_1.НаименованиеТовараНаЭтикетке + " продукции пропущено.");
					
						КонецЕсли;
						
					КонецЦикла;
ИначеЕсли ДокОснование.КоляскиGS.Количество()>0 Тогда
					Для Каждого Стр_1 Из ДокОснование.КоляскиGS Цикл
						Если ЗначениеЗаполнено(Стр_1.GTIN) Тогда
							ШтрихКод=СокрЛП(xmlstring(Стр_1.GTIN));
				             Продукция=Неопределено;
				Попытка
					Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("GTIN",число(ШтрихКод));
				исключение
				КонецПопытки;
				Если Не ЗначениеЗАполнено(Продукция) Тогда
					Попытка
						Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("КодВУчетнойСистеме",Число(ШтрихКод));
					Исключение
					КонецПопытки;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Продукция) Тогда
					Сообщить("Не правильный отсканированный штрихкод "+ШтрихКод);
					Продолжить;
				КонецЕсли;
				НСтр=Товары.НайтиСтроки(Новый Структура("GTIN",Продукция));
				Если НСтр.Количество()=0 Тогда
					НСтр=Товары.Добавить();
				НСтр.GTIN=Продукция;
				    НСтр.КодТНВЭД=Продукция.КодТНВЭД;
						Если Продукция.СтранаПроизводства.Альфа2="RU" Тогда
				НСтр.СпособВыпускаТоваров="Производство в РФ";
			Иначе
						НСтр.СпособВыпускаТоваров="Ввезен в РФ";
				
			КонецЕсли;

ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.UNIT;
Если Найти(Врег(Продукция.ТипУпаковки.Наименование),"BUNDLE")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.BUNDLE;
	
ИначеЕсли Найти(Врег(Продукция.ТипУпаковки.Наименование),"SET")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.SET;
	
	
Конецесли;
НСтр.ТипКодаМаркировки=ТипКодаМаркировки;
			
			
				ПолучитьПараметрыПоПльзователию=ПолучитьПараметрыПоПользователю(ТекущийПользователь);
					ЗаполнитьЗначенияСвойств(НСтр, ПолучитьПараметрыПоПльзователию);
				Иначе
					НСтр=Нстр[0];
				КонецЕсли;
					НСтр.НомерСтрокиСвязи=НСтр.НомерСтроки;
					Если ЗначениеЗаполнено(Стр_1.КоличествоКМ) Тогда
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+Стр_1.КоличествоКМ;
					Иначе
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+1;
					КонецЕсли;
				
			
				Иначе
					Сообщить("При копировании наименование "+ Стр_1.НаименованиеТовараНаЭтикетке + " продукции пропущено.");
					
						КонецЕсли;
						
					КонецЦикла;
ИначеЕсли ДокОснование.РамыGS.Количество()>0 Тогда
					Для Каждого Стр_1 Из ДокОснование.БельеGS Цикл
						Если ЗначениеЗаполнено(Стр_1.GTIN) Тогда
							ШтрихКод=СокрЛП(xmlstring(Стр_1.GTIN));
				             Продукция=Неопределено;
				Попытка
					Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("GTIN",число(ШтрихКод));
				исключение
				КонецПопытки;
				Если Не ЗначениеЗАполнено(Продукция) Тогда
					Попытка
						Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("КодВУчетнойСистеме",Число(ШтрихКод));
					Исключение
					КонецПопытки;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Продукция) Тогда
					Сообщить("Не правильный отсканированный штрихкод "+ШтрихКод);
					Продолжить;
				КонецЕсли;
				НСтр=Товары.НайтиСтроки(Новый Структура("GTIN",Продукция));
				Если НСтр.Количество()=0 Тогда
					НСтр=Товары.Добавить();
				НСтр.GTIN=Продукция;
				    НСтр.КодТНВЭД=Продукция.КодТНВЭД;
						Если Продукция.СтранаПроизводства.Альфа2="RU" Тогда
				НСтр.СпособВыпускаТоваров="Производство в РФ";
			Иначе
						НСтр.СпособВыпускаТоваров="Ввезен в РФ";
				
			КонецЕсли;

ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.UNIT;
Если Найти(Врег(Продукция.ТипУпаковки.Наименование),"BUNDLE")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.BUNDLE;
	
ИначеЕсли Найти(Врег(Продукция.ТипУпаковки.Наименование),"SET")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.SET;
	
	
Конецесли;
НСтр.ТипКодаМаркировки=ТипКодаМаркировки;
			
				ПолучитьПараметрыПоПльзователию=ПолучитьПараметрыПоПользователю(ТекущийПользователь);
					ЗаполнитьЗначенияСвойств(НСтр, ПолучитьПараметрыПоПльзователию);
				Иначе
					НСтр=Нстр[0];
				КонецЕсли;
					НСтр.НомерСтрокиСвязи=НСтр.НомерСтроки;
					Если ЗначениеЗаполнено(Стр_1.КоличествоКМ) Тогда
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+Стр_1.КоличествоКМ;
					Иначе
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+1;
					КонецЕсли;
				
			
				Иначе
					Сообщить("При копировании наименование "+ Стр_1.НаименованиеТовараНаЭтикетке + " продукции пропущено.");
					
						КонецЕсли;
						
					КонецЦикла;
ИначеЕсли ДокОснование.БельеGS.Количество()>0 Тогда
					Для Каждого Стр_1 Из ДокОснование.БельеGS Цикл
						Если ЗначениеЗаполнено(Стр_1.GTIN) Тогда
							ШтрихКод=СокрЛП(xmlstring(Стр_1.GTIN));
				             Продукция=Неопределено;
				Попытка
					Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("GTIN",число(ШтрихКод));
				исключение
				КонецПопытки;
				Если Не ЗначениеЗАполнено(Продукция) Тогда
					Попытка
						Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("КодВУчетнойСистеме",Число(ШтрихКод));
					Исключение
					КонецПопытки;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Продукция) Тогда
					Сообщить("Не правильный отсканированный штрихкод "+ШтрихКод);
					Продолжить;
				КонецЕсли;
				НСтр=Товары.НайтиСтроки(Новый Структура("GTIN",Продукция));
				Если НСтр.Количество()=0 Тогда
					НСтр=Товары.Добавить();
				НСтр.GTIN=Продукция;
				    НСтр.КодТНВЭД=Продукция.КодТНВЭД;
						Если Продукция.СтранаПроизводства.Альфа2="RU" Тогда
				НСтр.СпособВыпускаТоваров="Производство в РФ";
			Иначе
						НСтр.СпособВыпускаТоваров="Ввезен в РФ";
				
			КонецЕсли;

			
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.UNIT;
Если Найти(Врег(Продукция.ТипУпаковки.Наименование),"BUNDLE")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.BUNDLE;
	
ИначеЕсли Найти(Врег(Продукция.ТипУпаковки.Наименование),"SET")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.SET;
	
	
Конецесли;
НСтр.ТипКодаМаркировки=ТипКодаМаркировки;
			
				ПолучитьПараметрыПоПльзователию=ПолучитьПараметрыПоПользователю(ТекущийПользователь);
					ЗаполнитьЗначенияСвойств(НСтр, ПолучитьПараметрыПоПльзователию);
				Иначе
					НСтр=Нстр[0];
				КонецЕсли;
					НСтр.НомерСтрокиСвязи=НСтр.НомерСтроки;
					Если ЗначениеЗаполнено(Стр_1.КоличествоКМ) Тогда
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+Стр_1.КоличествоКМ;
					Иначе
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+1;
					КонецЕсли;
				
			
				Иначе
					Сообщить("При копировании наименование "+ Стр_1.НаименованиеТовараНаЭтикетке + " продукции пропущено.");
					
						КонецЕсли;
						
					КонецЦикла;
ИначеЕсли ДокОснование.ФотоGS.Количество()>0 Тогда
					Для Каждого Стр_1 Из ДокОснование.ФотоGS Цикл
						Если ЗначениеЗаполнено(Стр_1.GTIN) Тогда
							ШтрихКод=СокрЛП(xmlstring(Стр_1.GTIN));
				             Продукция=Неопределено;
				Попытка
					Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("GTIN",число(ШтрихКод));
				исключение
				КонецПопытки;
				Если Не ЗначениеЗАполнено(Продукция) Тогда
					Попытка
						Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("КодВУчетнойСистеме",Число(ШтрихКод));
					Исключение
					КонецПопытки;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Продукция) Тогда
					Сообщить("Не правильный отсканированный штрихкод "+ШтрихКод);
					Продолжить;
				КонецЕсли;
				НСтр=Товары.НайтиСтроки(Новый Структура("GTIN",Продукция));
				Если НСтр.Количество()=0 Тогда
					НСтр=Товары.Добавить();
				НСтр.GTIN=Продукция;
				    НСтр.КодТНВЭД=Продукция.КодТНВЭД;
						Если Продукция.СтранаПроизводства.Альфа2="RU" Тогда
				НСтр.СпособВыпускаТоваров="Производство в РФ";
			Иначе
						НСтр.СпособВыпускаТоваров="Ввезен в РФ";
				
			КонецЕсли;

ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.UNIT;
Если Найти(Врег(Продукция.ТипУпаковки.Наименование),"BUNDLE")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.BUNDLE;
	
ИначеЕсли Найти(Врег(Продукция.ТипУпаковки.Наименование),"SET")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.SET;
	
	
Конецесли;
НСтр.ТипКодаМаркировки=ТипКодаМаркировки;
			
				ПолучитьПараметрыПоПльзователию=ПолучитьПараметрыПоПользователю(ТекущийПользователь);
					ЗаполнитьЗначенияСвойств(НСтр, ПолучитьПараметрыПоПльзователию);
				Иначе
					НСтр=Нстр[0];
				КонецЕсли;
					НСтр.НомерСтрокиСвязи=НСтр.НомерСтроки;
					Если ЗначениеЗаполнено(Стр_1.КоличествоКМ) Тогда
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+Стр_1.КоличествоКМ;
					Иначе
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+1;
					КонецЕсли;
				
			
				Иначе
					Сообщить("При копировании наименование "+ Стр_1.НаименованиеТовараНаЭтикетке + " продукции пропущено.");
					
						КонецЕсли;
						
					КонецЦикла;
		ИначеЕсли ДокОснование.ОдеждаGS.Количество()>0 Тогда
					Для Каждого Стр_1 Из ДокОснование.ОдеждаGS Цикл
						Если ЗначениеЗаполнено(Стр_1.GTIN) Тогда
							ШтрихКод=СокрЛП(xmlstring(Стр_1.GTIN));
				             Продукция=Неопределено;
				Попытка
					Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("GTIN",число(ШтрихКод));
				исключение
				КонецПопытки;
				Если Не ЗначениеЗАполнено(Продукция) Тогда
					Попытка
						Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("КодВУчетнойСистеме",Число(ШтрихКод));
					Исключение
					КонецПопытки;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Продукция) Тогда
					Сообщить("Не правильный отсканированный штрихкод "+ШтрихКод);
					Продолжить;
				КонецЕсли;
				НСтр=Товары.НайтиСтроки(Новый Структура("GTIN",Продукция));
				Если НСтр.Количество()=0 Тогда
					НСтр=Товары.Добавить();
				НСтр.GTIN=Продукция;
				    НСтр.КодТНВЭД=Продукция.КодТНВЭД;
						Если Продукция.СтранаПроизводства.Альфа2="RU" Тогда
				НСтр.СпособВыпускаТоваров="Производство в РФ";
			Иначе
						НСтр.СпособВыпускаТоваров="Ввезен в РФ";
				
			КонецЕсли;
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.UNIT;
Если Найти(Врег(Продукция.ТипУпаковки.Наименование),"BUNDLE")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.BUNDLE;
	
ИначеЕсли Найти(Врег(Продукция.ТипУпаковки.Наименование),"SET")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.SET;
	
	
Конецесли;
НСтр.ТипКодаМаркировки=ТипКодаМаркировки;

				ПолучитьПараметрыПоПльзователию=ПолучитьПараметрыПоПользователю(ТекущийПользователь);
					ЗаполнитьЗначенияСвойств(НСтр, ПолучитьПараметрыПоПльзователию);
				Иначе
					НСтр=Нстр[0];
				КонецЕсли;
					НСтр.НомерСтрокиСвязи=НСтр.НомерСтроки;
					Если ЗначениеЗаполнено(Стр_1.КоличествоКМ) Тогда
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+Стр_1.КоличествоКМ;
					Иначе
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+1;
					КонецЕсли;
				
			
				Иначе
					Сообщить("При копировании наименование "+ Стр_1.НаименованиеТовараНаЭтикетке + " продукции пропущено.");
					
						КонецЕсли;
						
					КонецЦикла;
		ИначеЕсли ДокОснование.ВелосипедыGS.Количество()>0 Тогда
					Для Каждого Стр_1 Из ДокОснование.ВелосипедыGS Цикл
						Если ЗначениеЗаполнено(Стр_1.GTIN) Тогда
							ШтрихКод=СокрЛП(xmlstring(Стр_1.GTIN));
				             Продукция=Неопределено;
				Попытка
					Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("GTIN",число(ШтрихКод));
				исключение
				КонецПопытки;
				Если Не ЗначениеЗАполнено(Продукция) Тогда
					Попытка
						Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("КодВУчетнойСистеме",Число(ШтрихКод));
					Исключение
					КонецПопытки;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Продукция) Тогда
					Сообщить("Не правильный отсканированный штрихкод "+ШтрихКод);
					Продолжить;
				КонецЕсли;
				НСтр=Товары.НайтиСтроки(Новый Структура("GTIN",Продукция));
				Если НСтр.Количество()=0 Тогда
					НСтр=Товары.Добавить();
				НСтр.GTIN=Продукция;
				    НСтр.КодТНВЭД=Продукция.КодТНВЭД;
						Если Продукция.СтранаПроизводства.Альфа2="RU" Тогда
				НСтр.СпособВыпускаТоваров="Производство в РФ";
			Иначе
						НСтр.СпособВыпускаТоваров="Ввезен в РФ";
				
			КонецЕсли;

ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.UNIT;
Если Найти(Врег(Продукция.ТипУпаковки.Наименование),"BUNDLE")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.BUNDLE;
	
ИначеЕсли Найти(Врег(Продукция.ТипУпаковки.Наименование),"SET")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.SET;
	
	
Конецесли;
НСтр.ТипКодаМаркировки=ТипКодаМаркировки;
			
				ПолучитьПараметрыПоПльзователию=ПолучитьПараметрыПоПользователю(ТекущийПользователь);
					ЗаполнитьЗначенияСвойств(НСтр, ПолучитьПараметрыПоПльзователию);
				Иначе
					НСтр=Нстр[0];
				КонецЕсли;
					НСтр.НомерСтрокиСвязи=НСтр.НомерСтроки;
					Если ЗначениеЗаполнено(Стр_1.КоличествоКМ) Тогда
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+Стр_1.КоличествоКМ;
					Иначе
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+1;
					КонецЕсли;
				
			
				Иначе
					Сообщить("При копировании наименование "+ Стр_1.НаименованиеТовараНаЭтикетке + " продукции пропущено.");
					
						КонецЕсли;
						
					КонецЦикла;
			
					
		ИначеЕсли ДокОснование.ПарфюмGS.Количество()>0 Тогда
					Для Каждого Стр_1 Из ДокОснование.ПарфюмGS Цикл
						Если ЗначениеЗаполнено(Стр_1.GTIN) Тогда
							ШтрихКод=СокрЛП(xmlstring(Стр_1.GTIN));
				             Продукция=Неопределено;
				Попытка
					Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("GTIN",число(ШтрихКод));
				исключение
				КонецПопытки;
				Если Не ЗначениеЗАполнено(Продукция) Тогда
					Попытка
						Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("КодВУчетнойСистеме",Число(ШтрихКод));
					Исключение
					КонецПопытки;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Продукция) Тогда
					Сообщить("Не правильный отсканированный штрихкод "+ШтрихКод);
					Продолжить;
				КонецЕсли;
				НСтр=Товары.НайтиСтроки(Новый Структура("GTIN",Продукция));
				Если НСтр.Количество()=0 Тогда
					НСтр=Товары.Добавить();
				НСтр.GTIN=Продукция;
				    НСтр.КодТНВЭД=Продукция.КодТНВЭД;
						Если Продукция.СтранаПроизводства.Альфа2="RU" Тогда
				НСтр.СпособВыпускаТоваров="Производство в РФ";
			Иначе
						НСтр.СпособВыпускаТоваров="Ввезен в РФ";
				
			КонецЕсли;
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.UNIT;
Если Найти(Врег(Продукция.ТипУпаковки.Наименование),"BUNDLE")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.BUNDLE;
	
ИначеЕсли Найти(Врег(Продукция.ТипУпаковки.Наименование),"SET")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.SET;
	
	
Конецесли;
НСтр.ТипКодаМаркировки=ТипКодаМаркировки;

				ПолучитьПараметрыПоПльзователию=ПолучитьПараметрыПоПользователю(ТекущийПользователь);
					ЗаполнитьЗначенияСвойств(НСтр, ПолучитьПараметрыПоПльзователию);
				Иначе
					НСтр=Нстр[0];
				КонецЕсли;
					НСтр.НомерСтрокиСвязи=НСтр.НомерСтроки;
					Если ЗначениеЗаполнено(Стр_1.КоличествоКМ) Тогда
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+Стр_1.КоличествоКМ;
					Иначе
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+1;
					КонецЕсли;
				
			
				Иначе
					Сообщить("При копировании наименование "+ Стр_1.НаименованиеТовараНаЭтикетке + " продукции пропущено.");
					
						КонецЕсли;
						
					КонецЦикла;
			
		ИначеЕсли ДокОснование.Шины.Количество()>0 Тогда
					Для Каждого Стр_1 Из ДокОснование.Шины Цикл
						Если ЗначениеЗаполнено(Стр_1.GTIN) Тогда
							ШтрихКод=СокрЛП(xmlstring(Стр_1.GTIN));
				             Продукция=Неопределено;
				Попытка
					Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("GTIN",число(ШтрихКод));
				исключение
				КонецПопытки;
				Если Не ЗначениеЗАполнено(Продукция) Тогда
					Попытка
						Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("КодВУчетнойСистеме",Число(ШтрихКод));
					Исключение
					КонецПопытки;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Продукция) Тогда
					Сообщить("Не правильный отсканированный штрихкод "+ШтрихКод);
					Продолжить;
				КонецЕсли;
				НСтр=Товары.НайтиСтроки(Новый Структура("GTIN",Продукция));
				Если НСтр.Количество()=0 Тогда
					НСтр=Товары.Добавить();
				НСтр.GTIN=Продукция;
				    НСтр.КодТНВЭД=Продукция.КодТНВЭД;
						Если Продукция.СтранаПроизводства.Альфа2="RU" Тогда
				НСтр.СпособВыпускаТоваров="Производство в РФ";
			Иначе
						НСтр.СпособВыпускаТоваров="Ввезен в РФ";
				
			КонецЕсли;
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.UNIT;
Если Найти(Врег(Продукция.ТипУпаковки.Наименование),"BUNDLE")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.BUNDLE;
	
ИначеЕсли Найти(Врег(Продукция.ТипУпаковки.Наименование),"SET")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.SET;
	
	
Конецесли;
НСтр.ТипКодаМаркировки=ТипКодаМаркировки;

				ПолучитьПараметрыПоПльзователию=ПолучитьПараметрыПоПользователю(ТекущийПользователь);
					ЗаполнитьЗначенияСвойств(НСтр, ПолучитьПараметрыПоПльзователию);
				Иначе
					НСтр=Нстр[0];
				КонецЕсли;
					НСтр.НомерСтрокиСвязи=НСтр.НомерСтроки;
					Если ЗначениеЗаполнено(Стр_1.КоличествоКМ) Тогда
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+Стр_1.КоличествоКМ;
					Иначе
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+1;
					КонецЕсли;
				
			
				Иначе
					Сообщить("При копировании наименование "+ Стр_1.НаименованиеТовараНаЭтикетке + " продукции пропущено.");
					
						КонецЕсли;
						
					КонецЦикла;
				
			Иначе
					Для Каждого Стр_1 Из ДокОснование.GS1 Цикл
						Если ЗначениеЗаполнено(Стр_1.GTIN) Тогда
			ШтрихКод=СокрЛП(xmlstring(Стр_1.GTIN));
				
				              			Продукция=Неопределено;
				Попытка
					Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("GTIN",число(ШтрихКод));
				исключение
				КонецПопытки;
				Если Не ЗначениеЗАполнено(Продукция) Тогда
					Попытка
						Продукция=Справочники.Продукция_ХамелеонЦРПТ.НайтиПоРеквизиту("КодВУчетнойСистеме",Число(ШтрихКод));
					Исключение
					КонецПопытки;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Продукция) Тогда
					Сообщить("Не правильный отсканированный штрихкод "+ШтрихКод);
					Продолжить;
				КонецЕсли;
				НСтр=Товары.НайтиСтроки(Новый Структура("GTIN",Продукция));
				Если НСтр.Количество()=0 Тогда
					НСтр=Товары.Добавить();
				НСтр.GTIN=Продукция;
				    НСтр.КодТНВЭД=Продукция.КодТНВЭД;
						Если Продукция.СтранаПроизводства.Альфа2="RU" Тогда
				НСтр.СпособВыпускаТоваров="Производство в РФ";
			Иначе
						НСтр.СпособВыпускаТоваров="Ввезен в РФ";
				
			КонецЕсли;
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.UNIT;
Если Найти(Врег(Продукция.ТипУпаковки.Наименование),"BUNDLE")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.BUNDLE;
	
ИначеЕсли Найти(Врег(Продукция.ТипУпаковки.Наименование),"SET")=1 Тогда
ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.SET;
	
	
Конецесли;
НСтр.ТипКодаМаркировки=ТипКодаМаркировки;

				ПолучитьПараметрыПоПльзователию=ПолучитьПараметрыПоПользователю(ТекущийПользователь);
					ЗаполнитьЗначенияСвойств(НСтр, ПолучитьПараметрыПоПльзователию);
				Иначе
					НСтр=Нстр[0];
				КонецЕсли;
					НСтр.НомерСтрокиСвязи=НСтр.НомерСтроки;
					Если ЗначениеЗаполнено(Стр_1.КоличествоКМ) Тогда
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+Стр_1.КоличествоКМ;
					Иначе
						НСтр.КоличествоКМ=НСтр.КоличествоКМ+1;
					КонецЕсли;
				
			
				Иначе
					Сообщить("При копировании наименование "+ Стр_1.НаименованиеТовараНаЭтикетке + " продукции пропущено.");
					
						КонецЕсли;
						
					КонецЦикла;
			
				КонецЕсли;
				
		если ТекущийПользователь.ТипВводаВОборот=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.МаркировкаОстатков Тогда
			СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.МаркировкаОстатков;
		ИначеЕсли ТекущийПользователь.ТипВводаВОборот=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВводВОборотИмпорт Тогда
			СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.ВвезенВРФ;
		Иначе
			СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.ПроизведенВРФ
		КонецЕсли;
	//Организация=Объект.ТекущийПользователь.Организация;
	
		ШаблонКМ=ТекущийПользователь.ШаблонКМПоУмолчанию;
		ШаблонКМ_Табак=ТекущийПользователь.ШаблонКМТабакПоУмолчанию;
	
	
	АвтоСерийные=ТекущийПользователь.ФормироватьСерийныеНомераАвтоматически;
	ТипОплаты=ТекущийПользователь.ТипОплаты;
	ШаблонЭтикетки=ТекущийПользователь.ШаблонЭтикетки;
		НомерДоговораСОператором=ТекущийПользователь.НомерДоговораСОператором;
		ДатаДоговораСОператором=ТекущийПользователь.ДатаДоговораСОператором;
		ШаблонЭтикетки=ТекущийПользователь.ШаблонЭтикетки;
	Для Каждого Стр Из Товары Цикл
		Если Не ЗначениеЗаполнено(Стр.СпособФормированияСН) Тогда
			Стр.СпособФормированияСН=ТекущийПользователь.СпособФормированияСН;
			
		КонецЕслИ;
		Если Не ЗначениеЗаполнено(Стр.ВидСИ) Тогда
			Стр.ВидСИ=ТекущийПользователь.ВидСИ;
			
		КонецЕслИ;
		Если Не ЗначениеЗаполнено(Стр.ВидМаркировки) Тогда
			Стр.ВидМаркировки=ТекущийПользователь.ВидМаркировки;
		КонецЕслИ;
	Конеццикла;
	
				
	         КонецЕсли;
		//ЭтотОбъект.ТипДокумента=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВводВОборотИмпорт;
			 
			
	КонецЕсли;
	
	
	
КонецПроцедуры

Функция ПолучитьПараметрыПоПользователю(Польз)
	
	Возврат Новый Структура("СпособФормированияСН,ВидМаркировки,ВидСИ",Польз.СпособФормированияСН,Польз.ВидМаркировки,Польз.ВидСИ);
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Вставить содержимое обработчика.
	Если ЭтотОбъект.СпособВыпускаТоваров<>Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.МаркировкаОстатков Тогда
//		ПроверяемыеРеквизиты.Добавить("Товары.КодТНВЭД");
		
	КонецЕслИ;
КонецПроцедуры
